{
  "CP": "Alla fine dell'Unità di Apprendimento gli studenti saranno in grado di descrivere le funzioni di un SIA (Sistema Informativo Aziendale) e di identificare i suoi componenti principali. Gli studenti dovranno anche essere in grado di illustrare un caso di applicazione di un SIA all'interno di un'azienda.",
  "Competenze": [
    {
      "Europee": [
        {
          "Comp": "Competenza digitale"
        },
        {
          "Comp": "Imprenditorialità"
        }
      ],
      "Professionali": [
        {
          "Comp": "Conoscenza dei processi aziendali e delle loro interconnessioni"
        },
        {
          "Comp": "Capacità di analisi e sintesi dei flussi informativi aziendali"
        }
      ],
      "DiArea": [
        {
          "Comp": "Interpretare i sistemi aziendali nei loro modelli, processi e flussi informativi con riferimento alle differenti tipologie di imprese"
        },
        {
          "Comp": "Utilizzare le reti e gli strumenti informatici nelle attività di studio, ricerca e approfondimento disciplinare"
        }
      ]
    }
  ],
  "Abilita": [
    {
      "A": "Comprendere le funzioni di un SIA e identificare i suoi principali componenti"
    },
    {
      "A": "Distinguere tra i vari tipi di SIA"
    }
  ],
  "Conoscenze": [
    {
      "C": "Principi e funzioni dei Sistemi Informativi Aziendali"
    },
    {
      "C": "Componenti e struttura di un SIA"
    }
  ],
  "Prerequisiti": [
    {
      "P": "Conoscenza di base del funzionamento di un'azienda e dei suoi processi interni"
    },
    {
      "P": "Familiarità con l'uso dei computer e delle applicazioni software di base"
    }
  ],
  "Esperienze": "Lezioni frontali, esercizi pratici di caso, discussioni di gruppo e progetto finale che prevede la presentazione di un esempio di SIA applicato a un'azienda.",
  "Metodologie": [
    {
      "M": "Lezione frontale"
    },
    {
      "M": "Apprendimento basato su problemi"
    },
    {
      "M": "Apprendimento cooperativo"
    }
  ],
  "Strumenti": [
    {
      "S": "Libro di testo"
    },
    {
      "S": "Computer e software per la presentazione"
    },
    {
      "S": "Internet per la ricerca"
    }
  ],
  "Valutazioni": [
    {
      "V": "Valutazione sommativa mediante test a risposta multipla alla fine dell'unità"
    },
    {
      "V": "Valutazione formativa attraverso l'osservazione durante le lezioni e i lavori di gruppo"
    },
    {
      "V": "Autovalutazione e valutazione tra pari su presentazione del progetto"
    }
  ]
}